#=================================================================
# مشروع تحليل المبيعات
# Sales Analysis Project
# السنة: 2026
#==================================================================

#==================================================================
# 1. استدعاء المكتبات
#==================================================================

# مكتبة Numpy تستخدم لانشاء المصفوفات والتعامل مع الارقام
import numpy as np
# مكتبة Pandas تستخدم لانشاء الجداول وتحليل البيانات
import pandas as pd
# مكتبة Matplotlib تستخدم لانشاء الرسومات البيانية
import matplotlib.pyplot as plt
#===================================================================
# 2. انشاء مصفوفة تحتوي على اشهر السنة
#===================================================================
# انشاء مصفوفة Numpy تحتوي على 12 شهرا
months = np.array([ "January",
    "February",
    "March",
    "April",
    "May",
    "June",
    "July",
    "August",
    "September",
    "October",
    "November",
    "December"])
#=======================================================================
#3. انشاء بيانات مبيعات المنتجات
#=======================================================================
# مبيعات أجهزة Laptop  لكل شهر
laptop = np.array([12000,15000,18000,16000,19000,21000,23000,22000,25000,27000,29000,31000])
# مبيعات أجهزة Phone لكل شهر
phone = np.array([20000,22000,25000,24000,27000,29000,31000,30000,33000,35000,37000,40000])
# مبيعات أجهزة Tablet لكل شهر
tablet = np.array([10000,12000,14000,13000,15000,17000,18000,19000,21000,22000,24000,26000])
# مبيعات أجهزة Headphones لكل شهر
headphones = np.array([5000,7000,9000,8000,10000,11000,13000,14000,15000,16000,18000,20000])
# مبيعات أجهزة Smartwatch لكل شهر
smartwatch = np.array([7000,8000,10000,11000,12000,14000,15000,16000,18000,19000,21000,23000])
# مبيعات أجهزة Camera لكل شهر
camera = np.array([9000,10000,12000,11000,13000,15000,16000,17000,19000,20000,22000,24000])
# مبيعات Printer لكل شهر
printer = np.array([6000,7000,8000,7500,9000,10000,11000,12000,13000,14000,15000,17000])
# مبيعات Monitor لكل شهر
monitor = np.array([8000,9000,11000,10000,12000,14000,15000,16000,18000,19000,21000,23000])
# مبيعات Keyboard لكل شهر
keyboard = np.array([4000,5000,6000,5500,7000,8000,9000,1000,11000,12000,14000,15000])
# مبيعات Mouse لكل شهر 
mouse = np.array([3000,4000,5000,4500,6000,7000,8000,8500,9500,10000,12000,13000])
#=============================================================================================
# 4.  انشاء جدول بيانات باستخدام Pandas
#=============================================================================================
# انشاء DataFrame يحتوى على الاشهر ومبيعات جميع المنتجات
data = pd.DataFrame({"Month": months,"Laptop": laptop,"Phone": phone,"Tablet": tablet,"Headphones": headphones,"Smartwatch": smartwatch,"Camera": camera,"Printer": printer,"Monitor": monitor,"Keyboard": keyboard,"Mouse": mouse})
#=============================================================================================
# عرض جدول المبيعات
#=============================================================================================
# طباعة عنوان القسم
print("\n=========== SALES DATA ================")
# طباعة جدول البيانات كاملا
print(data)
#=============================================================================================
# 6. عرض معلومات الجدول
#=============================================================================================
# طباعة عنوان القسم
print("\n=============== DATA INFORMATION ===============")
# عرض عدد الصفوف والاعمدة وانواع البيانات والقيم الموجودة
data.info()
#=============================================================================================
# 7. عرض الاحصائيات
#==============================================================================================
# طباعة عنوان القسم
print("\n================ STATISTICS ==================")
# عرض الاحصائيات الاساسية للبيانات الرقمية
print(data.describe())
#==============================================================================================
# 8. حساب اجمالي مبيعات كل منتج
#==============================================================================================
# حذف عمود Month لانه يحتوي على اسماء وليس ارقام
# ثم جمع مبيعات كل منتج خلال السنة
product_sales = data.drop(columns="Month").sum()
# طباعة عنوان القسم 
print("\n============= TOTAL SALES BY PRODUCT =================")
# عرض اجمالي مبيعات كل منتج
print(product_sales)
#==============================================================================================
# 9. حساب متوسط مبيعات كل منتج
#==============================================================================================
# حذف عمود Month
# ثم حساب متوسط مبيعات كل منتج
average_sales = data.drop(columns="Month").mean()
# طباعة عنوان القسم
print("\n=================== AVERAGE SALES ==================")
# عرض متوسط المبيعات
print(average_sales)
#==============================================================================================
# 10. تحديد أفضل منتج من حيث المبيعات 
#==============================================================================================
# idxmax() ترجع اسم المنتج الذي لديه اعلى اجمالي مبيعات 
best_product = product_sales.idxmax()
# max() ترجع أعلى قيمة للمبيعات
best_product_sales = product_sales.max()
# طباعة عنوان القسم
print("\n================= BEST PRODUCT ================")
# طباعة اسم افضل منتج
print("product:", best_product)
# طباعة اجمالي مبيعات أفضل منتج
print("Total Sales:", best_product_sales)
#=============================================================================================
# 11. تحديد أقل منتج من حيث المبيعات
#=============================================================================================
# idxmin() ترجع اسم المنتج الذي لديه اقل اجمالي مبيعات
worst_product = product_sales.idxmin()
# min() ترجع أقل قيمة للمبيعات
worst_product_sales = product_sales.min()
# طباعة عنوان القسم
print("\n================= LOWEST PRODUCT ===================")
# طباعة اسم أقل منتج
print("product:", worst_product)
# طباعة اجمالي مبيعات اقل منتج
print("Total Sales:", worst_product_sales)
#==============================================================================================
# 12. ترتيب المنتجات من الاعلى الى الاقل
#==============================================================================================
# sort_ values() تستخدم لترتيب البيانات
# ascending=Fales يعني من الاكبر الى الاصغر
sorted_products = product_sales.sort_values(ascending=False)
# طباعة عنوان القسم
print("\n======================= PRODUCT RANKING ======================")
# عرض المنتجات بعد ترتيبها
print(sorted_products)
#=============================================================================================
# 13. استخراج أفضل 5 منتجات
#=============================================================================================
# head(5) تعني استخراج أول خمسة عناصر
top_5_products = sorted_products.head(5)
# طباعة عنوان القسم
print("\n==================== TOP 5 PRODUCTS =====================")
# عرض أفضل خمسة منتجات
print(top_5_products)
#=============================================================================================
# 14. حساب اجمالي المبيعات لكل شهر
#=============================================================================================
# Month حذف عمود
# sum(axis=1) تجمع مبيعات جميع المنتجات داخل كل صف 
# اي حساب اجمالي مبيعات كل شهر
monthly_sales = data.drop(columns="Month"). sum(axis=1)
# طباعة عنوان القسم 
print("\n==================== MOTHLY SALES =====================")
# عرض اجمالي مبيعات كل شهر
print(monthly_sales)
#==============================================================================================
# 15. تحديد أفضل شهر
#==============================================================================================
# idxmax() تحديد رقم الصف الذي يحتوي على اعلى مبيعات
best_month_index = monthly_sales.idxmax()
# استخدم Loc للوصول الى اسم الشهر في ذلك الصف
best_month = data.loc[best_month_index,"Month"]
# max() تحدد أعلى قيمة للمبيعات الشهرية
best_product_sales = monthly_sales.max()
#===============================================================================================
# 16. تحديد أقل شهر
#===============================================================================================
# idxmin() تحديد رقم الصف الذي يحتوي على أقل مبيعات 
worst_month_index = monthly_sales.idxmin()
# استخدم Loc للوصول الى اسم الشهر
worst_month = data.loc[worst_month_index,"Month"]
# min() تحدد أقل قيمة للمبيعات الشهرية
worst_product_sales = monthly_sales.min()
#==============================================================================================
# 17.  عرض التحليل النهائي
#===============================================================================================
# طباعة عنوان التحليل النهائي
print("\n==================== FINAL ANALYSIS ====================")
# عرض أفضل منتج
print("Best Product:", best_product)
# عرض مبيعات أفضل منتج
print("Best product Sales:", best_product_sales)
# عرض أقل منتج
print("Lowest Product:", worst_product)
# عرض مبيعات أقل منتج
print("Lowest Product Sales:", worst_product_sales)
# عرض أفضل شهر
print("Best Month:", best_month)
# عرض مبيعات أفضل شهر
print("Best Month Sales:", best_product_sales)
# عرض أقل شهر
print("Lowest Month:", worst_month)
# عرض مبيعات أقل شهر
print("Lowest Month Sales:", worst_product_sales)
#===============================================================================================
# 18. انشاء مساحة للرسومات البيانية
#===============================================================================================
# 10 * 14 انشاء نافذة للرسومات بحجم
plt.figure(figsize=(14, 10))
#===============================================================================================
# 19.  اضافة العنوان الرئيسي للمشروع
#===============================================================================================
# اضافة عنوان رئيسي لجميع الرسومات
plt.suptitle("Annual Sales Analysis - 2026",fontsize=18)
#===============================================================================================
# 20. Bar Chart - الرسم الاول
#===============================================================================================
# تقسيم النافذة الى صفين وعمودين ووضع الرسم في المكان الاول
plt.subplot(2,2,1)
# انشاء رسم اعمدة
# index =  اسماء المنتجات
# values =  قيم المبيعات
plt.bar(product_sales.index, product_sales.values)
# اضافة عنوان للرسم
plt.title("Total Sales by Product")
# تسمية المحور الافقي
plt.xlabel("Product")
# تسمية المحور الرأسي
plt.ylabel("Sales")
# تدوير اسماء المنتجات بزاوية 45 درجة
plt.xticks(rotation=45)
#=================================================================================================
# Line Chart - الرسم الثاني
#=================================================================================================
# وضع الرسم الثاني في المكان الثاني
plt.subplot(2,2,2)
# انشاء رسم خطي للمبيعات الشهرية
# months = المحور الافقي
# monthly_sales =  المحور الرأسي
plt.plot(months,monthly_sales,linestyle='-')
# اضافة عنوان للرسم
plt.title("Month Sales")
# تسمية المحور الافقي
plt.xlabel("Month")
# تسمية المحور الرأسي
plt.ylabel('Total Sales')
# تدوير أسماء الأشهر
plt.xticks(rotation=45)
#================================================================================================
# 22. Pie Chart - الرسم الثالث
#================================================================================================
# وضع الرسم الثالث في المكان الثالث
plt.subplot(2,2,3)
# انشاء رسم دائري يوضح نسبة مبيعات المنتجات
plt.pie(product_sales.values, labels=product_sales.index,autopct='%1.1f%%')
# اضافة عنوان للرسم
plt.title("Sales Distribution by Product")
#================================================================================================
# 23. Histogram - الرسم الرابع
#================================================================================================
# وضع الرسم الرابع في المكان الرابع
plt.subplot(2,2,4)
# انشاء Histogram لتوزيع المبيعات الشهرية
plt.hist(monthly_sales,bins=6)
# اضافة عناون للرسم 
plt.title("Monthly Sales Distribution")
# تسمية المحور الافقي
plt.xlabel("Sales")
# تسمية المحور الرأسي
plt.ylabel("Freguency")
#================================================================================================
# 24. ترتيب وتنسيق الرسومات
#================================================================================================
# منع تداخل الرسومات والعناوين مع بعضها
# rect تترك مساحة للعنوان الرئيسي في الاعلى
plt.tight_layout(rect=[0,0,1,0.95])
#================================================================================================
# 25. عرض جميع الرسومات
#================================================================================================
# اظهار الرسومات البيانية على الشاشة
plt.show()